[
    {
        "troop": "621",
        "founded": 2012,
        "meetingDay": "Wednesday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Windemere Ranch Middle School",
        "address": "11611 East Branch Parkway, San Ramon, CA 94583",
        "city": "San Ramon",
        "distance": null,
        "size": 90,
        "sizeCategory": "large",
        "charteredOrg": "Lions Club International",
        "eagles": "45+",
        "eagleCount": 45,
        "programFocus": "High Adventure & Eagle Achievement",
        "philosophyApproach": "Boy-run and active troop in accordance with Scouting tradition. Comprehensive advancement program for new scouts (Webelos) designed to get them to First Class rank quickly.",
        "activityFrequency": "Several per month, approximately 35 outings per year",
        "monthlyOutings": "At least one overnight camp per month plus day trips",
        "regularActivities": "Camping overnights, day trips, bike rides, ski trips, snow camping, backpacking, kayaking, midnight broomball, service projects (Scouting for Food)",
        "specializedPrograms": {
            "cycling": "Mid-August to October: 8-10 rides (10/15/25 miles) leading to 50-mile final ride. Golden Gate Bridge ride is a highlight. Earns Cycling Merit Badge.",
            "backpacking": "Over 10 practice hikes (10-20 miles, some overnight) leading to either 50-mile backpacking trip or Philmont",
            "snowCamping": "1-2 mile snowshoe hike, build snow shelters (cave, igloo, hop house), camp overnight in snow shelter without tent"
        },
        "highAdventure": "Philmont Scout Ranch (2015, 2017, 2019, 2021, 2025) with multiple treks per year, 50-mile backpacking in alternate years",
        "highAdventureShort": "Philmont (2025), 50-mile backpacking",
        "summerCamps": "Different camp every year. Past: Wolfeboro (2015, 2021), Emerald Bay (2019), Royaneh, Wente, Oljato, Cherry Valley, Chawanakee",
        "leadershipStructure": "Scoutmaster: Sathish Nayak. First Wednesday of each month is Patrol Leader's Council (PLC) for elected troop leaders. Scoutmaster conferences for Tenderfoot/Second Class/First Class at regular meetings.",
        "parentInvolvement": {
            "deposit": "$400",
            "hoursRequired": 12,
            "details": "$400 deposit at registration, refundable to scout account after 12 volunteer hours. Unclaimed funds: 60% to Friends of Scouting, 40% to Troop. All parents must complete YPT (Youth Protection Training) and IOLS for overnight camps."
        },
        "dues": "$400 PIP deposit (refundable after 12 volunteer hours)",
        "contact": "troop621sanramon@gmail.com",
        "website": "https://www.troopwebhost.org/Troop621SanRamon",
        "adultLeaders": "30+ trained adults",
        "reputation": "One of the fastest growing troops in Meridian District. Named to honor Daniel Carter Beard (6/21/1850), one of founders of American Scouting. Among the most active troops in Bay Area for outings and high adventure.",
        "notes": "Founded 2012 to serve Windemere Ranch area. Strongest high adventure program with multiple Philmont treks per year. Very active with ~35 outings annually. Comprehensive cycling and backpacking programs.",
        "tags": ["outdoor", "eagle", "high-adventure", "boy-led", "cycling", "backpacking", "active"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 4,
            "newScoutFriendly": 5,
            "largeGroup": 5
        }
    },
    {
        "troop": "888",
        "founded": 1982,
        "meetingDay": "Monday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Gale Ranch Middle School",
        "address": "6400 Main Branch Road, San Ramon, CA 94582",
        "city": "San Ramon",
        "distance": null,
        "size": 110,
        "sizeCategory": "large",
        "charteredOrg": "American Legion Post 246",
        "eagles": "100+",
        "eagleCount": 100,
        "flyerImage": "assets/troop888/troop-888-2025-flyer.jpeg",
        "programFocus": "Character, Citizenship, Physical & Mental Fitness",
        "philosophyApproach": "One of the most active and respected units in the area. Dedicated to development of character, citizenship, physical and mental fitness. Strive to provide a scouting experience filled with variety and diversity. Engaged scouts in the program and journey, not the end result. Consistently receives the Quality Unit Award.",
        "activityFrequency": "Extremely active calendar with comprehensive outdoor program",
        "monthlyOutings": "Regular monthly outdoor activities plus special events like broomball on ice, curling, picnics, laser tag, escape rooms, K1 racing",
        "regularActivities": "Camping, backpacking, conservation projects, merit badges, Camporee, Trooporee (troop camporee), new scout hikes, service projects",
        "specializedPrograms": {
            "highAdventure": "Philmont 2024 (40-50 miles, 9-day trek with blacksmithing, muzzle-loading, summiting Baldy Mountain at 12,441 feet); Northern Tier 2024 (8-day trek, 75 miles by canoe in Canadian Crownlands with portaging, earned 75 Miler award)",
            "summerCampSpecialties": "Wolfeboro annual tradition with Sourdough program, rockers (special awards), Pioneer status for multi-year attendees",
            "newScoutProgram": "Comprehensive first year program with Patrol Leaders, Troop Guides, and dedicated ASMs. Special new scout hikes and advancement support during PLC meetings"
        },
        "highAdventure": "Philmont 2022, 2023, 2024, 2025 (multiple crews); Northern Tier 2024 (first crew); all four BSA High Adventure bases available",
        "highAdventureShort": "Philmont (2025), Northern Tier (2024), Summit (2025)",
        "summerCamps": "Two camps every year. Wolfeboro (annual - 2023, 2024, 2025), Camp Cherry Valley Catalina Island (2023), Royaneh (2024 - cabins, ATV program, Eagle-required merit badges, horseback riding)",
        "leadershipStructure": "Scoutmaster: Anand Ranganathan (Wood Badge, Wilderness First Aid, CPR/AED certified, Philmont Leader 2022-2023). Multiple ASMs organized by patrol. Active Eagle Advisors. Parent meetings every two months on 2nd Monday.",
        "parentInvolvement": {
            "deposit": 0,
            "hoursRequired": 0,
            "details": "Parent engagement strongly encouraged. Parent meetings bimonthly. Volunteer opportunities for merit badge counselors, ASMs, Eagle advisors, and activity leaders."
        },
        "dues": "Contact for details",
        "contact": "scoutmaster@troop888.us",
        "website": "https://www.troop888.us/",
        "adultLeaders": "35+ ASMs organized by patrol, multiple Eagle Advisors, Wood Badge trained leaders",
        "reputation": "One of the most active and respected troops in the area. Consistently receives Quality Unit Award. 100+ Eagle Scouts since 1988 (3-15 Eagles per year recently). Strong high adventure tradition with annual Philmont crews. First troop to document Northern Tier experience for future crews.",
        "notes": "Extremely active with comprehensive outdoor program. Annual Wolfeboro tradition. Recent high adventure: Philmont 2024, Northern Tier 2024. Unique Trooporee event (troop's camporee). Strong new scout support program. Patrol-based leadership structure.",
        "tags": ["balanced", "outdoor", "eagle", "high-adventure", "active", "quality-unit", "new-scout-friendly", "patrol-based"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 5,
            "newScoutFriendly": 5,
            "largeGroup": 4
        }
    },
    {
        "troop": "201",
        "founded": 1962,
        "meetingDay": "Tuesday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Canyon Creek Presbyterian Church",
        "address": "9015 S. Gale Ridge Road, San Ramon, CA 94582",
        "city": "San Ramon",
        "distance": null,
        "size": 45,
        "sizeCategory": "small",
        "charteredOrg": "Rotary Club of Dougherty Valley",
        "eagles": "65+",
        "eagleCount": 65,
        "programFocus": "Character, Citizenship, Fitness",
        "philosophyApproach": "First troop in San Ramon (chartered 1962). Traditional boy-led troop centered around 3 basic aims of Scouting: Character Development, Citizenship Training, Mental and Physical Fitness. Program centered around outdoor activities demonstrating 'Prepared for Life' philosophy. Every scout has ample opportunity to learn and practice leadership skills. Most Eagle Scouts continue active participation beyond 18th birthday.",
        "activityFrequency": "Weekly meetings plus at least one major outdoor activity per month",
        "monthlyOutings": "At least one major outdoor activity monthly, year-round program",
        "regularActivities": "Overnight campouts, snow camping, ski trips, day hikes, bicycling, District Camporee, service projects. Weekly meetings blend activity planning, advancement, games, and camaraderie.",
        "specializedPrograms": {
            "boyLedEmphasis": "Program planning and leadership provided by Scouts under guidance of Scoutmaster and ASMs. Supports Scouts in all ranks with active Eagle Scout participation.",
            "highAdventure": "Annual High Adventure Backpacking Outings. Philmont 2021 (7-day, 30-mile trek). Sea Base 2005 (Florida). British Columbia canoe trek 2003 (72-mile at Bowron Lake Provincial Park).",
            "internationalExperience": "Camp Pupukea Hawaii 2014 (2nd Scout Camp of year)"
        },
        "highAdventure": "Philmont 2021 (7-day, 30-mile); Sea Base 2005; British Columbia 2003 (72-mile canoe trek); annual High Adventure Backpacking",
        "highAdventureShort": "Philmont (2021), Sea Base (2005), BC (2003)",
        "summerCamps": "Camp Wolfeboro (annual tradition), Camp Pupukea Hawaii (2014). Year-round program with summer-time meetings since 2007.",
        "leadershipStructure": "Scoutmaster: James W. Ringener (current, returned 2022); Fil de Cal (2021-2022, Wood Badge, NYLT, HAT Backpacking, L.E.A.D., Unit Commissioner). Assistant Scoutmasters and Troop Committee with blend of experienced and new adults. All trips supervised by BSA-trained leaders.",
        "parentInvolvement": {
            "deposit": 0,
            "hoursRequired": 0,
            "details": "Most successful Scouts are supported by their families. Troop activities require active support of all troop families. Adult leadership includes uniformed leaders and Troop Committee members."
        },
        "dues": "$350 annual (prorated based on join date), $25 one-time fee if new to scouting. Webelos pay $200 (prorated) as BSA+Council fee paid by Cub Scout packs.",
        "contact": "membership@troop201srv.org",
        "website": "https://www.troop201srv.org/",
        "adultLeaders": "Blend of experienced and new adults among uniformed leaders and Troop Committee",
        "reputation": "First troop in San Ramon (chartered November 1962). Rich 60+ year history - originally Troop 1 in Walnut Creek (1934-1951), then Troop 201 Walnut Creek (1951-1962), relocated to San Ramon 1962. 65+ Eagle Scouts since 1966. Commemorative flag pole at Camp Wolfeboro for Eagle Scout Michael Grey (Vietnam War). 50th San Ramon anniversary celebrated 2012. Moved to current Canyon Creek location 2007 enabling year-round program.",
        "notes": "First and oldest troop in San Ramon with deep tradition. Traditional boy-led program. Year-round meetings including summer. Strong Eagle Scout legacy with most continuing beyond age 18. Virtual programming pioneer during COVID-19 (led Meridian District Virtual Camporee 2020).",
        "tags": ["tradition", "boy-led", "balanced", "first-in-san-ramon", "historic", "eagle", "year-round"],
        "scoutAttributes": {
            "outdoor": 4,
            "eagle": 5,
            "balanced": 5,
            "newScoutFriendly": 5,
            "largeGroup": 3
        }
    },
    {
        "troop": "805",
        "founded": 1985,
        "meetingDay": "Tuesday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Sycamore Valley Elementary School",
        "address": "2200 Holbrook Drive, Danville, CA 94526",
        "city": "Danville",
        "distance": null,
        "size": 70,
        "sizeCategory": "large",
        "charteredOrg": "Kiwanis Club of San Ramon Valley",
        "eagles": "149+",
        "eagleCount": 149,
        "programFocus": "Youth Leadership Development",
        "philosophyApproach": "Boy-run troop where scouts plan and carry out activities with adults facilitating. Strong emphasis on youth leadership training and development through experience. Adults encourage, guide, ensure safety but let scouts lead and learn from mistakes.",
        "activityFrequency": "Year-round weekly meetings (except late Nov/Dec), monthly camping/outdoor activities, multiple summer camps, high adventure trips",
        "monthlyOutings": "Monthly camping, backpacking, or outdoor activities. No break in summer.",
        "regularActivities": "Monthly camping/backpacking, service projects (Scouting for Food, beach/creek cleanups, Memorial Day flag planting, 9/11 ceremony), Kiwanis 4th of July Parade support, conservation projects, merit badge sessions, patrol competitions, flag ceremonies",
        "specializedPrograms": {
            "cycling": "Extensive cycling program with regular 10-25+ mile rides",
            "backpacking": "Introduction to backpacking, beginner courses, regular backpacking trips (Black Diamond Mines, Redwood Regional, Mt. Diablo)",
            "snowCamping": "Introduction to snow camping program at Carson Pass/Lake Tahoe",
            "climbing": "Rock climbing sessions at The Rock and Diablo Rock Gym, climbing merit badge opportunities",
            "highAdventure": "Regular Philmont treks, plans for Northern Tier and other high adventure bases",
            "shooting": "Archery (USA Archery Level II instructors on staff), rifle shooting, marksmanship weekends at Camp Tamarancho",
            "pioneering": "COPE courses, rappelling, team building activities"
        },
        "highAdventure": "Philmont (multiple crews), Northern Tier, planning for Sea Base and other BSA high adventure bases. Strong high adventure tradition.",
        "highAdventureShort": "Philmont, Northern Tier, Sea Base",
        "summerCamps": "Rotates between multiple camps: Camp Chawanakee (2024), Camp Royaneh (2025), Camp Wente (2021), Camp Wolfeboro (past years). Week-long resident summer camps with 40+ merit badge options.",
        "leadershipStructure": "Highly structured youth leadership with elected SPL (69 SPLs since 1985), appointed ASPLs, patrol leaders, and 15+ specialized positions (Quartermaster, Scribe, Historian, Librarian, Webmaster, Instructors, Troop Guides, OA Rep, Den Chiefs, etc.). Leadership training required. 6-month terms with goal-setting and accountability.",
        "parentInvolvement": {
            "structure": "All parents automatic Troop Committee members. Bi-monthly parent meetings (1st Tuesday). Parents encouraged as drivers (required 2+ trips/year), merit badge counselors, committee leaders, ASMs. Strong parent volunteer culture.",
            "requirements": "Provide transportation for at least 2 outdoor activities per year. Summer camp drop-off/pick-up as needed."
        },
        "eagleScoutRetention": "Very high - most Eagles remain active through age 18. Strong tradition of continued involvement. Unit College Scouter Reserves program for Eagles in college.",
        "reputation": "Established 1985 in Danville. 149 Eagle Scouts (as of Sept 2025). Co-founded by George H. Coughlin II (Silver Beaver 2007). Multiple Silver Beaver recipients (Ray Chan 2014, Kent Screechfield 2015, Sue Oki 2008). Known for exemplary boy-run program with scouts making decisions and learning from experience. Strong leadership development pipeline. Very structured with detailed processes, training, and accountability. Active in community service including Kiwanis partnership. Quality Unit Awards.",
        "uniqueSellingPoints": "• 149 Eagle Scouts over 40 years (3.7/year average)\n• Exceptional youth leadership training structure with 15+ specialized positions\n• Year-round programming (no summer break)\n• Extensive specialized programs (cycling, backpacking, snow camping, climbing, shooting sports)\n• Multiple adult leaders with advanced certifications (USA Archery Level II, NRA instructors, Wilderness First Aid, Wood Badge)\n• Strong high adventure tradition with regular Philmont crews\n• Comprehensive equipment program with dedicated Quartermasters\n• Active merit badge counselor network within troop\n• 40-year tradition of boy-run scouting\n• Strong Kiwanis partnership since founding",
        "dues": "$150 initial joining fee ($130 if crossing from Cubs - includes handbook, neckerchief, BSA registration). $150 annual membership (December) includes re-registration, Boys' Life, insurance, equipment maintenance. $200 FOS contribution requested (March). Popcorn sales go to Scout accounts for trips/equipment.",
        "contact": "recruiting@troop805.org",
        "contactMore": "recruiting@troop805.org\nPatrick Kuzmickas (Scoutmaster): pnkuzmickas@gmail.com\nAndy Szeto (Committee Chair): cc@troop805.org",
        "website": "https://troop805.org/",
        "adultLeaders": "Scoutmaster: Patrick Kuzmickas (Eagle Scout, USA Archery Level II). 25+ ASMs including multiple Eagle Scouts, Wood Badge trained leaders, specialized instructors (USA Archery Level II, NRA Rifle, Wilderness First Aid, CERT trained). Scoutmaster Emeriti: Ray Chan (Silver Beaver 2014, VP GGAC Program), George Coughlin II (Silver Beaver 2007, Co-founder), Neal Matsunaga (Eagle), Kent Screechfield (Silver Beaver 2015, Charter Org Rep), Sue Oki (Silver Beaver 2008, District Commissioner). Large active committee with 30+ volunteer positions.",
        "notes": "True boy-run troop since 1985. Scouts plan and lead meetings, activities, and outings with adult facilitation focused on safety and mentoring. Extensive youth leadership development system with structured accountability. Adults selected by Committee. Strong outdoor program year-round including specialized activities (cycling, backpacking, snow camping, climbing, shooting). 149 Eagles demonstrates sustained excellence. Multiple summer camp options. High adventure tradition. Deep community service commitment through Kiwanis partnership. Equipment policy teaches responsibility. Weekly meetings year-round (except holidays). Bi-monthly parent meetings. Very detailed processes and training for all roles. Strong emphasis on Scout Oath, Law, and outdoor ethics.",
        "tags": ["boy-led", "leadership", "high-adventure", "outdoor", "eagle", "established", "cycling", "backpacking", "climbing", "shooting-sports", "year-round", "community-service", "large"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 5,
            "newScoutFriendly": 5,
            "largeGroup": 4
        }
    },
    {
        "troop": "874",
        "founded": 1983,
        "meetingDay": "Tuesday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Pine Valley Middle School",
        "address": "3000 Pine Valley Road, San Ramon, CA 94583",
        "city": "San Ramon",
        "distance": null,
        "size": 75,
        "sizeCategory": "large",
        "charteredOrg": "Self-Chartered",
        "eagles": "116+",
        "eagleCount": 116,
        "programFocus": "Outdoor Adventure & High Adventure",
        "philosophyApproach": "Boy-run troop operating by patrol method, PLC plans activities with Scoutmaster & Committee oversight",
        "activityFrequency": "Monthly outdoor activities plus weekly meetings, 2 summer camps annually",
        "monthlyOutings": "At least one outdoor activity per month including camping, hiking, backpacking",
        "regularActivities": "Camping, hiking, backpacking, whitewater rafting, cycling, skiing/snowboarding, kayaking, winter camping, Scout-O orienteering, beach outings",
        "specializedPrograms": {
            "highAdventure": true,
            "backpacking": "Multiple troop-led backpacking trips throughout year for beginners and advanced",
            "leadershipTraining": "ILST 2x/year, NYLT 2x/year",
            "eagleMentoring": "Eagle Scout Advisors mentor Life Scouts through Eagle process"
        },
        "highAdventure": "Philmont (2023, 2025), Northern Tier (2023), Florida Sea Base (2024, 2025), Summit Bechtel Reserve (2022, 2026 planned), Yosemite backcountry week. Some scouts earned Grand Slam of High Adventure",
        "highAdventureShort": "Philmont (2025), Northern Tier (2023), Sea Base (2025), Summit (2022)",
        "summerCamps": "Camp Wolfeboro every June, plus one other 6-day resident camp each July (2025: Camp Royaneh)",
        "leadershipStructure": "Boy-led with Patrol Leaders' Council (PLC). SPL: Evan Li. 7 active patrols. Leadership positions rotate June-November",
        "parentInvolvement": {
            "description": "Parents help with special projects, monthly committee meetings. Core group of leaders but always need new parents",
            "committeeStructure": "9 Executive Committee members, monthly meetings"
        },
        "eagleScoutRetention": "116 Eagle Scouts from 1989-2025 (2.9 Eagles/year average over 40+ years)",
        "reputation": "Active troop with 40+ year tradition. Multiple Wolfeboro Pioneers among leadership. 9 of 16 adult leaders are Wood Badge alumni. Strong high adventure program with Grand Slam achievers",
        "dues": "$125 troop dues + $155 BSA registration (2025)",
        "contact": "scoutsbsa.gadad@gmail.com (SM: Vijay Gadad)",
        "website": "https://www.troopwebhost.org/Troop874SanRamon/",
        "adultLeaders": "Scoutmaster: Vijay Gadad. 16 direct-contact adult leaders (9 Wood Badge Alumni), 9 Executive Committee members. Multiple Wolfeboro Pioneers",
        "notes": "Very active troop with extensive outdoor program including monthly backpacking trips. Summer meetings at Boone Acres Park (June-July). Service: Scouting for Food, 9/11 ceremonies, coastal cleanup, Pine Valley MS support. Fundraising: Evergreen wreath sale, Christmas tree recycling (scouts keep large percentage for camp costs). Courts of Honor twice yearly",
        "tags": ["outdoor", "high-adventure", "boy-led", "large-troop", "backpacking", "leadership-training"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 4,
            "newScoutFriendly": 4,
            "largeGroup": 5
        }
    },
    {
        "troop": "1776",
        "founded": 2000,
        "meetingDay": "Friday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Church of the Valley",
        "address": "19001 San Ramon Valley Blvd, San Ramon, CA 94583",
        "city": "San Ramon",
        "distance": null,
        "size": 30,
        "sizeCategory": "small",
        "charteredOrg": "Parents of 1776",
        "eagles": "15+ in last 5 years",
        "eagleCount": 15,
        "programFocus": "Scout-Planned Program & Sea Scouting",
        "philosophyApproach": "Boy Scouts plan, prepare and execute their own program. Adults facilitate the program the scouts have planned. Affiliated with Ship 1776 Sea Scout crew",
        "activityFrequency": "Weekly meetings during school year, monthly campouts, annual summer camp",
        "monthlyOutings": "Scout-planned monthly outings including Mt Diablo Campout, Archery Camp Out, Sunset State Beach, Klondike Derby, Trail Bike Rides",
        "regularActivities": "Camping, hiking, backpacking, archery, biking, sailing, power boating through Ship 1776 affiliation",
        "specializedPrograms": {
            "seaScouting": "Affiliated with Ship 1776 for sailing and power boating activities",
            "webelosOutreach": "Aquanaut (August water safety at Cal High Pool), Zombie First Aid (October), Pizza Hike (Fall on Shady Slope Trail)"
        },
        "highAdventure": "Contact troop for high adventure opportunities",
        "highAdventureShort": "Contact troop",
        "summerCamps": "Camp Marin Sierra (2024). Summer meetings at Cal High Pool (June-July)",
        "leadershipStructure": "Scout-led program. First Friday of each month is PLC meeting where scout leaders plan monthly meetings",
        "parentInvolvement": {
            "description": "Each family expected to volunteer 10 hours per year",
            "volunteerHoursRequired": 10
        },
        "eagleScoutRetention": "15 Eagles in last 5 years (3 Eagles/year average)",
        "reputation": "Unique Sea Scout affiliation offering both land and water activities. Friday meetings provide scheduling flexibility. Strong Webelos outreach program",
        "dues": "Contact for details",
        "contact": "KenNicholson@comcast.net",
        "website": "https://www.troopwebhost.org/Troop1776SanRamon/",
        "adultLeaders": "Scoutmaster: Ken Nicholson (Founding SM since April 2000, also Founding Skipper of Ship 1776). 7 Assistant Scoutmasters, 7 Committee members with specialized roles (Eagle Coordinator, Advancement Coordinator, Summer Camp Coordinator, etc.)",
        "notes": "Friday meetings (unique scheduling). Summer meetings at Cal High Pool. Affiliated with Ship 1776 for sailing/boating. Strong Webelos outreach. Service: Scouting for Food, Pleasanton Tree Planting, Veterans Parade. Yacht decoration and Lighted Yacht Parade events",
        "tags": ["sea-scouting", "small-troop", "scout-led", "friday-meetings", "aquatic"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 5,
            "newScoutFriendly": 5,
            "largeGroup": 1
        }
    },
    {
        "troop": "815",
        "founded": 1969,
        "meetingDay": "Monday",
        "meetingTime": "7:00 PM - 8:30 PM",
        "location": "Charlotte Wood Middle School",
        "address": "600 El Capitan Dr, Danville, CA 94526",
        "city": "Danville",
        "distance": null,
        "size": 75,
        "sizeCategory": "large",
        "charteredOrg": "Kiwanis Club of San Ramon Valley",
        "eagles": "225+",
        "eagleCount": 225,
        "programFocus": "Scout-Run Program & Eagle Achievement",
        "philosophyApproach": "Boy-Led troop run by Scouts, not adults. Scouts decide on and plan activities. Adults advise and coach in the background to develop maturity and leadership skills",
        "activityFrequency": "Weekly meetings with skill building, at least one camping/backpacking trip per month",
        "monthlyOutings": "12+ campouts/year including everything from Camporee to car camping to snow camping to week-long wilderness treks",
        "regularActivities": "Camping, backpacking, hiking, rafting, canoeing, archery, rifle/shotgun shooting, rock climbing, ziplining, mountain biking, whitewater rafting, midnight broomball, urban hikes, SF Giants Day",
        "specializedPrograms": {
            "firstYearProgram": "Comprehensive 'First Year' program designed to help scouts learn, achieve and advance. Focus on fun, new skills, and outdoor experience",
            "catalinaCamp": "Camp Emerald Bay on Catalina Island (usually every other summer - odd years) for 2nd year+ scouts with water and boating merit badge opportunities",
            "highAdventure": true,
            "shooting": "Rifle, shotgun, archery programs with certified instructors",
            "patrolSystem": "Two patrols at each age level, eight scouts per patrol for manageable boy-led structure"
        },
        "highAdventure": "Philmont, Northern Tier, Whitney, Lost Coast. Week-long wilderness treks with backpacks only or transport by canoe",
        "highAdventureShort": "Philmont, Northern Tier, Whitney, Lost Coast",
        "summerCamps": "Variety of summer camps: Chawanakee, Wente, Camp Emerald Bay (Catalina Island). Rotates locations annually",
        "leadershipStructure": "Scout-run program with Patrol Leadership Council (PLC) designing meetings and activities. PLC meets first Monday of month (6-7 PM). Troop Leadership Council (TLC) meets 3rd Monday",
        "parentInvolvement": {
            "description": "Parents help support both Scout and Troop. Many volunteer opportunities from trained adult leaders to non-training roles. Vitally important for troop health"
        },
        "eagleScoutRetention": "225+ Eagle Scouts since 1969 (4.0 Eagles/year average over 56 years). Proud tradition of Eagle achievement",
        "reputation": "\"Danville Pride\" Since 1969 - Oldest Boy Scout Troop in Danville. Well established with highly valued traditions. Reputation for leadership in Council. 56 years of excellence",
        "dues": "$220/year ($50 supports troop, $170 stays in scout's account for activities). New scouts receive: BSA Handbook, Troop 815 neckerchief & slide, Class B t-shirt, water bottle, patch",
        "contact": "info@troop815.net\nScoutmaster@troop815.net",
        "contactMore": "Jenn Bill (Recruiting Chair): (925)-735-8260, info@troop815.net; Joe Moss (Scoutmaster): (501) 282-8250, Scoutmaster@troop815.net",
        "website": "https://www.troop815.net/",
        "adultLeaders": "Scoutmaster: Joe Moss. 30+ trained adult leaders. Adults serve in background as advisors and coaches. 'Two Deep' leadership always practiced. Extensive network for coaching, advising, counseling and troubleshooting",
        "notes": "Oldest troop in Danville (56 years). Recruiting policy maintains manageable size for scout-run operation. Class A uniform required for meetings, flag ceremonies, public service. Summer meetings at Osage Station Park for outdoor activities (June-August). Service: Scouting for Food, Sandbag Brigade. Weekend trips: Pinnacles, Angel Island, Point Reyes. Scout Orienteering, Night Hikes",
        "tags": ["boy-led", "tradition", "outdoor", "high-achievement", "eagle", "catalina-camp", "shooting-sports"],
        "scoutAttributes": {
            "outdoor": 5,
            "eagle": 5,
            "balanced": 5,
            "newScoutFriendly": 5,
            "largeGroup": 4
        }
    }
]

